## Memory Optimization of Pandas DataFrames
(Preparation for the execution o operations on the Pandas DataFrames, like filtering for example)

* Practioner: Cleiber Garcia
* Date: 23 of January, 2023
* Objective: Practice memory optimization as preparation for the execution of operations on the Pandas DataFrames 

This notebook is based on the notebook written by Boris Pashkaver for the Course Data Analysis with Pandas and Python (Section 5: DataFrames II - Filtering Data), offered by Udemy. Although the degree of similarity between both notebooks is almost 100%, I built this notebook step by step.

Link: https://www.udemy.com/course/data-analysis-with-pandas/

For more information feel free to contact me at cleiber.garcia@gmail.com

## Memory Optimization

* Converting from string to date datatype
* Converting from string to boolean datatype
* Converting from string to category

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("employees.csv")

In [3]:
df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    object
 2   Start Date         1000 non-null   object
 3   Last Login Time    1000 non-null   object
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  933 non-null    object
 7   Team               957 non-null    object
dtypes: float64(1), int64(1), object(6)
memory usage: 62.6+ KB

In [5]:
df.shape

(1000, 8)

#### Converting from string do date datatype

In [6]:
df_bkp = df.copy() # df backing up

In [7]:
df["Start Date"]

0        8/6/1993
1       3/31/1996
2       4/23/1993
3        3/4/2005
4       1/24/1998
          ...
995    11/23/2014
996     1/31/1984
997     5/20/2013
998     4/20/2013
999     5/15/2012
Name: Start Date, Length: 1000, dtype: object

In [8]:
pd.to_datetime(df["Start Date"])

0     1993-08-06
1     1996-03-31
2     1993-04-23
3     2005-03-04
4     1998-01-24
         ...
995   2014-11-23
996   1984-01-31
997   2013-05-20
998   2013-04-20
999   2012-05-15
Name: Start Date, Length: 1000, dtype: datetime64[ns]

In [9]:
df["Start Date"] = pd.to_datetime(df["Start Date"])

In [10]:
pd.to_datetime(df["Last Login Time"])

0     2023-02-01 12:42:00
1     2023-02-01 06:53:00
2     2023-02-01 11:17:00
3     2023-02-01 13:00:00
4     2023-02-01 16:47:00
              ...
995   2023-02-01 06:09:00
996   2023-02-01 06:30:00
997   2023-02-01 12:39:00
998   2023-02-01 16:45:00
999   2023-02-01 18:24:00
Name: Last Login Time, Length: 1000, dtype: datetime64[ns]

In [11]:
df["Last Login Time"] = pd.to_datetime(df["Last Login Time"])

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    object
 2   Start Date         1000 non-null   datetime64[ns]
 3   Last Login Time    1000 non-null   datetime64[ns]
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  933 non-null    object
 7   Team               957 non-null    object
dtypes: datetime64[ns](2), float64(1), int64(1), object(4)
memory usage: 62.6+ KB

In [13]:
df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2023-02-01 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2023-02-01 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2023-02-01 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2023-02-01 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2023-02-01 16:47:00,101004,1.389,True,Client Services

#### Converting from string to boolean datatype

In [14]:
df["Senior Management"]

0       True
1       True
2      False
3       True
4       True
       ...
995    False
996    False
997    False
998    False
999     True
Name: Senior Management, Length: 1000, dtype: object

In [15]:
df["Senior Management"].astype("bool")

0       True
1       True
2      False
3       True
4       True
       ...
995    False
996    False
997    False
998    False
999     True
Name: Senior Management, Length: 1000, dtype: bool

In [16]:
df["Senior Management"] = df["Senior Management"].astype("bool")

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    object
 2   Start Date         1000 non-null   datetime64[ns]
 3   Last Login Time    1000 non-null   datetime64[ns]
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  1000 non-null   bool
 7   Team               957 non-null    object
dtypes: bool(1), datetime64[ns](2), float64(1), int64(1), object(3)
memory usage: 55.8+ KB

#### Converting string datatype to categories

In [18]:
df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2023-02-01 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2023-02-01 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2023-02-01 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2023-02-01 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2023-02-01 16:47:00,101004,1.389,True,Client Services

In [19]:
# Converting Gender to category
df["Gender"] = df["Gender"].astype("category")

In [20]:
# Converting Team to category
df["Team"] = df["Team"].astype("category")

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    category
 2   Start Date         1000 non-null   datetime64[ns]
 3   Last Login Time    1000 non-null   datetime64[ns]
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  1000 non-null   bool
 7   Team               957 non-null    category
dtypes: bool(1), category(2), datetime64[ns](2), float64(1), int64(1), object(1)
memory usage: 42.6+ KB

### Parsing dates directly in read_csv

In [23]:
df2 = pd.read_csv("employees.csv", parse_dates = ["Start Date", "Last Login Time"])

In [24]:
df2.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2023-02-01 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2023-02-01 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2023-02-01 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2023-02-01 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2023-02-01 16:47:00,101004,1.389,True,Client Services

In [25]:
df2["Senior Management"] = df2["Senior Management"].astype("bool")
df2["Gender"] = df2["Gender"].astype("category")
df2["Team"]   = df2["Team"].astype("category")

In [26]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    category
 2   Start Date         1000 non-null   datetime64[ns]
 3   Last Login Time    1000 non-null   datetime64[ns]
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  1000 non-null   bool
 7   Team               957 non-null    category
dtypes: bool(1), category(2), datetime64[ns](2), float64(1), int64(1), object(1)
memory usage: 42.6+ KB